/*
 * Copyright (C) 2018, 2019 Computer Graphics Group, University of Siegen
 * Written by Martin Lambers <martin.lambers@uni-siegen.de>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#ifndef TAD_ARRAY_HPP
#define TAD_ARRAY_HPP

#include <cassert>
#include <cstdint>
#include <cstring>
#include <vector>
#include <initializer_list>
#include <memory>

#include "taglist.hpp"

/**
 * \file array.hpp
 * \brief The libtad C++ interface.
 */

/**
 * \mainpage libtad Reference
 *
 * \section overview Tagged Array Data (TAD): Overview
 *
 * TAD manages multidimensional arrays. Each array element consists of a fixed
 * number of components. All components are of the same data type (integer or
 * floating point). For example, an array holding image data could be a
 * two-dimensional array with size 800x600, and each element could consist of
 * three uint8 components representing the R, G, and B channels.
 *
 * Metadata is managed using tags, which are key/value pairs where both key and
 * value are represented as strings. An array has a global tag lists (typically
 * describing the array data as a whole), dimension-specific tag lists (typically
 * describing the dimensions), and component-specific tag lists (typically
 * describing the interpretation of each component).
 *
 * \section lib The libtad Library
 *
 * The library works with the following classes: \a TAD::TagList to manage metadata,
 * \a TAD::ArrayDescription to handle all metadata describing an array, \a TAD::ArrayContainer
 * to handle array data of any type, and finally \a TAD::Array to handle arrays with
 * a specific data type so that convenient operations on the data are possible.
 *
 * All array data is shared by default when making copies of an array. If you want
 * a copy of the data, use \a TAD::ArrayContainer::deepCopy() or \a TAD::Array::deepCopy().
 *
 * Input and output are managed by the \a TAD::Importer and \a TAD::Exporter classes,
 * and there are shortcuts \a TAD::load() and \a TAD::save() to read and write arrays
 * in just one line of code.
 */

namespace TAD {

/*! \brief The data type that array element components can represent. */
enum Type
{
    int8  = 0,     /**< \brief int8_t */
    uint8 = 1,     /**< \brief uint8_t */
    int16 = 2,     /**< \brief int16_t */
    uint16 = 3,    /**< \brief uint16_t */
    int32 = 4,     /**< \brief int32_t */
    uint32 = 5,    /**< \brief uint32_t */
    int64 = 6,     /**< \brief int64_t */
    uint64 = 7,    /**< \brief uint64_t */
    float32 = 8,   /**< \brief IEEE 754 single precision floating point (on all relevant platforms: float) */
    float64 = 9,   /**< \brief IEEE 754 double precision floating point (on all relevant platforms: double) */
};

/*! \brief Returns the size of a TAD type. */
inline constexpr size_t typeSize(Type t)
{
    static_assert(sizeof(int8_t) == 1);
    static_assert(sizeof(uint8_t) == 1);
    static_assert(sizeof(int16_t) == 2);
    static_assert(sizeof(uint16_t) == 2);
    static_assert(sizeof(int32_t) == 4);
    static_assert(sizeof(uint32_t) == 4);
    static_assert(sizeof(int64_t) == 8);
    static_assert(sizeof(uint64_t) == 8);
    static_assert(sizeof(float) == 4);
    static_assert(sizeof(double) == 8);
    return (t == int8 ? sizeof(int8_t)
            : t == uint8 ? sizeof(uint8_t)
            : t == int16 ? sizeof(int16_t)
            : t == uint16 ? sizeof(uint16_t)
            : t == int32 ? sizeof(int32_t)
            : t == uint32 ? sizeof(uint32_t)
            : t == int64 ? sizeof(int64_t)
            : t == uint64 ? sizeof(uint64_t)
            : t == float32 ? sizeof(float)
            : t == float64 ? sizeof(double)
            : 0);
}

/*! \brief Returns the TAD component type that corresponds to the template parameter. */
template<typename T> inline constexpr Type typeFromTemplate();
/*! \cond */
template<> inline constexpr Type typeFromTemplate<int8_t>() { return int8; }
template<> inline constexpr Type typeFromTemplate<uint8_t>() { return uint8; }
template<> inline constexpr Type typeFromTemplate<int16_t>() { return int16; }
template<> inline constexpr Type typeFromTemplate<uint16_t>() { return uint16; }
