/*
 * Copyright (C) 2018, 2019, 2020, 2021, 2022
 * Computer Graphics Group, University of Siegen
 * Written by Martin Lambers <martin.lambers@uni-siegen.de>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#ifndef TGD_ARRAY_HPP
#define TGD_ARRAY_HPP

#include <cassert>
#include <cstdint>
#include <cstring>
#include <vector>
#include <initializer_list>
#include <memory>

#include "taglist.hpp"

/**
 * \file array.hpp
 * \brief The libtgd C++ interface.
 */

/**

 * describing the array data as a whole), dimension-specific tag lists (typically
 * describing the dimensions), and component-specific tag lists (typically
 * describing the interpretation of each component).
 *
 * \section lib The libtgd Library
 *
 * The library works with the following classes: \a TGD::TagList to manage metadata,
 * \a TGD::ArrayDescription to handle all metadata describing an array, \a TGD::ArrayContainer
 * to handle array data of any type, and finally \a TGD::Array to handle arrays with
 * a specific data type so that convenient operations on the data are possible.
 *
 * All array data is shared by default when making copies of an array. If you want
 * a copy of the data, use \a TGD::ArrayContainer::deepCopy() or \a TGD::Array::deepCopy().
 *
 * Input and output are managed by the \a TGD::Importer and \a TGD::Exporter classes,
 * and there are shortcuts \a TGD::load() and \a TGD::save() to read and write arrays
 * in just one line of code.
 *
 * \section manual TGD Manual
 *
 * The <a href="https://marlam.de/tgd/tgd-manual.html">tgd manual</a> contains
 * <a href="https://marlam.de/tgd/tgd-manual.html#file-formats">an overview of supported file formats</a>,
 * <a href="https://marlam.de/tgd/tgd-manual.html#tgd-file-format-specification">the specification of the native TGD file format</a>, and
 * <a href="https://marlam.de/tgd/tgd-manual.html#common-tags">a list of common tags</a>.
 *
 * \section examples Examples
 *
 * This program creates an image:
 * ~~~~~{.cpp}
 * #include <tgd/array.hpp>
 * #include <tgd/io.hpp>
 * 
 * int main(void)
 * {
 *     TGD::Array<uint8_t> image({800, 600}, 3);
 *     for (size_t y = 0; y < image.dimension(1); y++) {
 *         for (size_t x = 0; x < image.dimension(0); x++) {
 *             image[{x, y}][0] = x / (image.dimension(0) - 1.0f) * 255; // red
 *             image[{x, y}][1] = y / (image.dimension(1) - 1.0f) * 255; // green
 *             image[{x, y}][2] = 0;                                     // blue
 *         }
 *     }
 *     TGD::save(image, "image.ppm");
 *     return 0;
 * }
 * ~~~~~
 *
 * This example loads an image, extracts the red channel, and saves it to a file:
 * ~~~~~{.cpp}
 * #include <tgd/array.hpp>
 * #include <tgd/io.hpp>
 * 
 * int main(void)
 * {
 *     TGD::Array<uint8_t> image = TGD::load("image.ppm");
 *     TGD::Array<uint8_t> greenChannel(image.dimensions(), 1);
 *     for (size_t i = 0; i < greenChannel.elementCount(); i++) {
 *         greenChannel[i][0] = image[i][1];
 *     }
 *     TGD::save(greenChannel, "green.pgm");
 *     return 0;
 * }
 * ~~~~~
 *
 * This example modifies array data using operators and alternatively
 * TGD::forEachComponent() which works with lambdas, functors and functions.
 * There are also variants that take two arrays as input, and variants that
 * work on elements instead of components.
 * ~~~~~{.cpp}
 * #include <tgd/array.hpp>
 * #include <tgd/foreach.hpp>
 * #include <tgd/operators.hpp>
 * #include <tgd/io.hpp>
 * 
 * uint8_t func(uint8_t a)
 * {
 *     return a * a;
 * }
 * 
 * struct {
 *     uint8_t operator()(uint8_t a)
 *     {
 *         return a * a;
 *     }
 * } functor;
 * 
 * int main(void)
 * {
 *     TGD::Array<uint8_t> image = TGD::load("image.ppm");
 * 
 *     // Modify via operator
 *     TGD::Array<uint8_t> r3 = image * image;
 *     // Modify via lambda
 *     TGD::Array<uint8_t> r0 = TGD::forEachComponent(image, [] (uint8_t a) -> uint8_t { return a * a; });
 *     // Modify via function
 *     TGD::Array<uint8_t> r1 = TGD::forEachComponent(image, func);
 *     // Modify via functor
 *     TGD::Array<uint8_t> r2 = TGD::forEachComponent(image, functor);
 * 
 *     // Save results. All are the same.
 *     // Note that a*a will overflow an uint8_t, but that creates a nice pattern ;)
 *     TGD::save(r0, "r0.ppm");
 *     TGD::save(r1, "r1.ppm");
 *     TGD::save(r2, "r2.ppm");
 *     TGD::save(r3, "r3.ppm");
 *
 *     return 0;
 * }
 * ~~~~~
 *
 * This example shows that STL algorithms can work on TGD arrays both on
 * component and on element level:
 * ~~~~~{.cpp}
 * #include <algorithm>
 * #include <tgd/array.hpp>
 * #include <tgd/io.hpp>
 * 
 * int main(void)
 * {
 *     TGD::Array<uint8_t> image = TGD::load("image.ppm");
 * 
 *     TGD::Array<uint8_t> sorted = image.deepCopy();
 *     std::sort(sorted.componentBegin(), sorted.componentEnd());
 *     TGD::save(sorted, "sorted.ppm");
 * 
 *     TGD::Array<uint8_t> answer = image.deepCopy();
 *     std::for_each(answer.componentBegin(), answer.componentEnd(),
 *             [](uint8_t& v) { v = 42; });
 *     TGD::save(answer, "answer.ppm");
 * 
 *     TGD::Array<uint8_t> orange = image.deepCopy();
 *     std::for_each(orange.elementBegin(), orange.elementEnd(),
 *             [](uint8_t* v) { v[0] = 255; v[1] = 128; v[2] = 64; });
 *     TGD::save(orange, "orange.ppm");
 * 
 *     return 0;
 * }
 * ~~~~~
 *
 */

namespace TGD {

/*! \brief The data type that array element components can represent. */
enum Type
{
    int8  = 0,     /**< \brief int8_t */
    uint8 = 1,     /**< \brief uint8_t */
    int16 = 2,     /**< \brief int16_t */
    uint16 = 3,    /**< \brief uint16_t */
    int32 = 4,     /**< \brief int32_t */
    uint32 = 5,    /**< \brief uint32_t */
    int64 = 6,     /**< \brief int64_t */
    uint64 = 7,    /**< \brief uint64_t */
    float32 = 8,   /**< \brief IEEE 754 single precision floating point (on all relevant platforms: float) */
    float64 = 9,   /**< \brief IEEE 754 double precision floating point (on all relevant platforms: double) */
};

/*! \brief Returns the size of a TGD type. */
inline constexpr size_t typeSize(Type t)
{
    static_assert(sizeof(int8_t) == 1);
    static_assert(sizeof(uint8_t) == 1);
    static_assert(sizeof(int16_t) == 2);
    static_assert(sizeof(uint16_t) == 2);
    static_assert(sizeof(int32_t) == 4);
    static_assert(sizeof(uint32_t) == 4);
    static_assert(sizeof(int64_t) == 8);
    static_assert(sizeof(uint64_t) == 8);
    static_assert(sizeof(float) == 4);
    static_assert(sizeof(double) == 8);
    return (t == int8 ? sizeof(int8_t)
            : t == uint8 ? sizeof(uint8_t)
            : t == int16 ? sizeof(int16_t)
            : t == uint16 ? sizeof(uint16_t)
            : t == int32 ? sizeof(int32_t)
            : t == uint32 ? sizeof(uint32_t)
            : t == int64 ? sizeof(int64_t)
            : t == uint64 ? sizeof(uint64_t)
            : t == float32 ? sizeof(float)
            : t == float64 ? sizeof(double)
            : 0);
}

/*! \brief Returns the TGD component type that corresponds to the template parameter. */
template<typename T> inline constexpr Type typeFromTemplate();
/*! \cond */
template<> inline constexpr Type typeFromTemplate<int8_t>() { return int8; }
template<> inline constexpr Type typeFromTemplate<uint8_t>() { return uint8; }
template<> inline constexpr Type typeFromTemplate<int16_t>() { return int16; }
template<> inline constexpr Type typeFromTemplate<uint16_t>() { return uint16; }
